1C_config/src/Documents/ПлатежноеПоручение/ПлатежноеПоручение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежноеПоручение</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСчетах</registerRecords>
  <attributes>
    <name>СчетОтправителя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПолучателя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходДС</types>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
</mdclass:Document>

1C_config/src/Documents/ПлатежноеПоручение/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КнопкаПечать(Команда)
    
    Если Объект.Ссылка.Пустая() Тогда
        Сообщить("Документ еще не записан!");
        Возврат;
    КонецЕсли;
    
    // Получаем готовый табличный документ
    ТабДок = ПечатьНаСервере();
    
    ТабДок.ОтображатьСетку = Ложь;     
    ТабДок.Защита = Истина;            
	ТабДок.ТолькоПросмотр = Истина;   
	
    // Показываем
    ТабДок.Показать("Платежное поручение №" + Объект.Номер);
    
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
    
    ТабДок = Новый ТабличныйДокумент;
    
    // Получаем макет
    ДокументОбъект = РеквизитФормыВЗначение("Объект");
    Макет = ДокументОбъект.ПолучитьМакет("ПлатежкаПечать");
    Область = Макет.ПолучитьОбласть("Строка");
	
    
    Область.Параметры.Номер = Объект.Номер;
    Область.Параметры.Дата = Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
    Область.Параметры.Сумма = Объект.Сумма;
    Область.Параметры.Плательщик = Объект.СчетОтправителя.Владелец;
    Область.Параметры.СчетПлательщика = Объект.СчетОтправителя.Код;
    Область.Параметры.Получатель = Объект.СчетПолучателя.Владелец;
    Область.Параметры.СчетПолучателя = Объект.СчетПолучателя.Код;
    Область.Параметры.Назначение = Объект.НазначениеПлатежа;
    
    // Выводим
    ТабДок.Вывести(Область);
    
    Возврат ТабДок;
    
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Объект.Дата = ТекущаяДата();
    
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
    
    // Если выбрали документ - заполняем данные
    Если НЕ Объект.ДокументОснование.Пустая() Тогда
        ЗаполнитьПоОснованиюНаСервере();
        БлокироватьПоля();
    Иначе
        // Если очистили - разблокируем поля
        РазблокироватьПоля();
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованиюНаСервере()
    
    // Получаем объект документа-основания
    ДокОбъект = Объект.ДокументОснование.ПолучитьОбъект();
    
    Если ДокОбъект = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Контрагент = ДокОбъект.Контрагент;
    
    НашСчет = ПолучитьНашОсновнойСчет();
    
    ОсновнойСчетКонтрагента = ПолучитьОсновнойСчетКонтрагента(Контрагент);
    
    // Если это Счет на оплату 
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату") Тогда
        
        Объект.Сумма = ДокОбъект.Сумма;
        Объект.НазначениеПлатежа = "Оплата по счету №" + ДокОбъект.Номер + " от " + Формат(ДокОбъект.Дата, "ДФ=dd.MM.yyyy");
        
        Объект.СчетОтправителя = ОсновнойСчетКонтрагента;
        
        Объект.СчетПолучателя = НашСчет;
        
    КонецЕсли;
    
    // Если это Заявка на расход
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРасходДС") Тогда
        
        Объект.Сумма = ДокОбъект.Сумма;
        Объект.НазначениеПлатежа = "Оплата по заявке №" + ДокОбъект.Номер + " от " + Формат(ДокОбъект.Дата, "ДФ=dd.MM.yyyy");
        
        Объект.СчетОтправителя = НашСчет;
        
        Объект.СчетПолучателя = ОсновнойСчетКонтрагента;
        
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновнойСчетКонтрагента(Контрагент)
    
    Если Контрагент = Неопределено Или Контрагент.Пустая() Тогда
        Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
    КонецЕсли;
    
    // Ищем основной счет контрагента
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   БанковскиеСчета.Ссылка
    |ИЗ
    |   Справочник.БанковскиеСчета КАК БанковскиеСчета
    |ГДЕ
    |   БанковскиеСчета.Владелец = &Контрагент
    |   И БанковскиеСчета.Основной = ИСТИНА";
    
    Запрос.УстановитьПараметр("Контрагент", Контрагент);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    КонецЕсли;
    
    // Если нет основного, берем первый попавшийся счет
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |   БанковскиеСчета.Ссылка
    |ИЗ
    |   Справочник.БанковскиеСчета КАК БанковскиеСчета
    |ГДЕ
    |   БанковскиеСчета.Владелец = &Контрагент";
    
    Запрос.УстановитьПараметр("Контрагент", Контрагент);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    КонецЕсли;
    
    Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
    
КонецФункции

&НаСервере
Функция ПолучитьНашОсновнойСчет()
    
    НомерНашегоСчета = "40817000000005";
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   БанковскиеСчета.Ссылка
    |ИЗ
    |   Справочник.БанковскиеСчета КАК БанковскиеСчета
    |ГДЕ
    |   БанковскиеСчета.Код = &НомерСчета";
    
    Запрос.УстановитьПараметр("НомерСчета", НомерНашегоСчета);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    КонецЕсли;
    
    Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
    
КонецФункции

&НаКлиенте
Процедура БлокироватьПоля()
    
    Если Объект.ДокументОснование <> Неопределено И НЕ Объект.ДокументОснование.Пустая() Тогда
        
        Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату") Тогда
            // Для Счета на оплату
            Элементы.СчетОтправителя.Доступность = Истина; 
			Элементы.СчетПолучателя.Доступность = Ложь;    
            
        ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРасходДС") Тогда
            // Для Заявки на расход
            Элементы.СчетОтправителя.Доступность = Ложь;    
            Элементы.СчетПолучателя.Доступность = Ложь;    
        КонецЕсли;
        
    КонецЕсли;
    
    Элементы.Сумма.Доступность = Ложь;
    Элементы.НазначениеПлатежа.Доступность = Ложь;
    
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьПоля()
    
    Элементы.СчетОтправителя.Доступность = Истина;
    Элементы.СчетПолучателя.Доступность = Истина;
    Элементы.Сумма.Доступность = Истина;
    Элементы.НазначениеПлатежа.Доступность = Истина;
    
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОснование(Команда)  
	
	Если Элементы.Сумма.Доступность = Ложь Тогда
    
	    Объект.ДокументОснование = Неопределено;
	    
	    Объект.Сумма = 0;
	    Объект.НазначениеПлатежа = "";
	    
	    ОчиститьСчетаНаСервере();
	    
	    РазблокироватьПоля();   
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ОчиститьСчетаНаСервере()
    
    Объект.СчетОтправителя = Справочники.БанковскиеСчета.ПустаяСсылка();
    Объект.СчетПолучателя = Справочники.БанковскиеСчета.ПустаяСсылка();
    
КонецПроцедуры
